STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Sink/STM32_WPAN/App/pbp_app.c
        if (status == BLE_STATUS_SUCCESS)
        {
          /* Starts an Observation procedure */
          status = aci_gap_start_observation_proc(SCAN_INTERVAL,
                                                  SCAN_WINDOW,
                                                  0x00,              /* LE_Scan_Type */
                                                  0x00,              /* Address type: Public */
                                                  0x00,              /* Filter duplicates: No */
                                                  0x00 );            /* Filter policy: Accept all */
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gap_start_observation_proc() function, result: 0x%02X\n", status);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gap_start_observation_proc() function\n");
          PBPAPP_Context.ScanState = PBPAPP_SCAN_STATE_SCANNING;
          }
        }
      }
    }
    break;

    case PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT:
    {
      PBP_Broadcast_Source_Adv_Report_Data_t *data = (PBP_Broadcast_Source_Adv_Report_Data_t*) pNotification->pInfo;
      LOG_INFO_APP(">>== PBP_PBK_BROADCAST_SOURCE_ADV_REPORT_EVT\n");
      LOG_INFO_APP("     - Broadcasting Device with address %02X:%02X:%02X:%02X:%02X:%02X\n",
                  data->pBAPReport->pAdvAddress[5],
                  data->pBAPReport->pAdvAddress[4],
                  data->pBAPReport->pAdvAddress[3],
                  data->pBAPReport->pAdvAddress[2],
                  data->pBAPReport->pAdvAddress[1],
                  data->pBAPReport->pAdvAddress[0]);
      if(PBPAPP_Context.PASyncState == PBPAPP_PA_SYNC_STATE_IDLE
         && PBPAPP_Context.BIGSyncState == PBPAPP_BIG_SYNC_STATE_IDLE)
      {
        uint8_t index = 0;
        while (index + 8 < data->pBAPReport->AdvertisingDataLength)
        {
          if (data->pBAPReport->pAdvertisingData[index+1] == 0xFF)
          {
            /* Found Manufacturer Data */
            if (data->pBAPReport->pAdvertisingData[index+7] == (aSourceIdList[CurrentID] & 0xFF)
                && data->pBAPReport->pAdvertisingData[index+8] == ((aSourceIdList[CurrentID] >> 8) & 0xFF)
                  && data->pBAPReport->pAdvertisingData[index+9] == ((aSourceIdList[CurrentID] >> 16) & 0xFF))
            {
              /* Matching Broadcast Source ID */
              uint8_t status;
              PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_SYNCHRONIZING;
              status = PBP_PBK_StartPASync(data->pBAPReport->AdvSID,
                                           data->pBAPReport->pAdvAddress,
                                           data->pBAPReport->AdvAddressType,
                                           PA_EVENT_SKIP,
                                           PA_SYNC_TIMEOUT);
              LOG_INFO_APP("==>> Starting Broadcasting DiscoveryDevice with Source %02X:%02X:%02X:%02X:%02X:%02X\n",
                                data->pBAPReport->pAdvAddress[5],
                                data->pBAPReport->pAdvAddress[4],
                                data->pBAPReport->pAdvAddress[3],
                                data->pBAPReport->pAdvAddress[2],
                                data->pBAPReport->pAdvAddress[1],
                                data->pBAPReport->pAdvAddress[0]);
              if (status != BLE_STATUS_SUCCESS)
              {
                LOG_INFO_APP("  Fail   : PBP_PBK_StartPASync() function, result: 0x%02X\n", status);
              }
              else
              {
                LOG_INFO_APP("  Success: PBP_PBK_StartPASync() function\n");
              }
              break;
            }
            else
            {
              /* Search next */
              index += data->pBAPReport->pAdvertisingData[index] + 1;
            }
          }
          else
          {
            /* Search next */
            index += data->pBAPReport->pAdvertisingData[index] + 1;
          }
        }
      }
    }
    break;

    case PBP_PBK_PA_SYNC_ESTABLISHED_EVT:
    {
      LOG_INFO_APP(">>== PBP_PBK_PA_SYNC_ESTABLISHED_EVT\n");
      BAP_PA_Sync_Established_Data_t *data = (BAP_PA_Sync_Established_Data_t*) pNotification->pInfo;
      LOG_INFO_APP("     - SyncHandle : 0x%02x\n",data->SyncHandle);
      PBPAPP_Context.PASyncHandle = data->SyncHandle;
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_SYNCHRONIZED;
    }
    break;

    case PBP_PBK_PA_SYNC_LOST_EVT:
      LOG_INFO_APP(">>== PBP_PBK_PA_SYNC_LOST_EVT\n");
      PBPAPP_Context.PASyncState = PBPAPP_PA_SYNC_STATE_IDLE;
    break;

    case PBP_PBK_BASE_REPORT_EVT:
      {
        BAP_BASE_Report_Data_t *base_data;
        uint8_t status;
        uint8_t index = 0;
        uint8_t i;
        uint8_t j;
        uint8_t k;
        uint8_t l;
        LOG_INFO_APP(">>== PBP_PBK_BASE_REPORT_EVT\n");

        base_data = (BAP_BASE_Report_Data_t*) pNotification->pInfo;

        status = CAP_Broadcast_ParseBASEGroup(base_data->pBasePayload,
                                              base_data->BasePayloadLength,
                                              &(PBPAPP_Context.base_group),
                                              &(index));

        PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);
        PBPAPP_Context.base_subgroups[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[0][0]);
        PBPAPP_Context.base_subgroups[0].pMetadata = &(PBPAPP_Context.subgroup_metadata[0][0]);
        PBPAPP_Context.base_subgroups[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[1][0]);
        PBPAPP_Context.base_subgroups[1].pMetadata = &(PBPAPP_Context.subgroup_metadata[1][0]);


        PBPAPP_Context.base_bis[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[0][0]);
        PBPAPP_Context.base_bis[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[1][0]);

        if(status == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("==>> Start BAP BSNK Parse BASE Group INFO\n");
          LOG_INFO_APP("   Payload Len role : 0x%02x\n",base_data->BasePayloadLength);
          LOG_INFO_APP("   Presentation_delay: 0x%08x\n",PBPAPP_Context.base_group.PresentationDelay);
          LOG_INFO_APP("   Num_subgroups : 0x%02x\n",PBPAPP_Context.base_group.NumSubgroups);
          base_data->pBasePayload += index;
          base_data->BasePayloadLength -= index;

          /* Parse Subgroups */
          for (i = 0; i < PBPAPP_Context.base_group.NumSubgroups && status == BLE_STATUS_SUCCESS; i++)
          {
            status = CAP_Broadcast_ParseBASESubgroup(base_data->pBasePayload,
                                                     base_data->BasePayloadLength,
                                                     &(PBPAPP_Context.base_subgroups[i]),
                                                     &(index));
            base_data->pBasePayload += index;
            base_data->BasePayloadLength -= index;

            PBPAPP_Context.base_subgroups[i].pBIS = &(PBPAPP_Context.base_bis[i]);
            LOG_INFO_APP("    BAP_BSNK_ParseBASESubgroup INFO Number :%d\n", i);
            LOG_INFO_APP("    Codec ID : 0x%08x\n",PBPAPP_Context.base_subgroups[i].CodecID);
            LOG_INFO_APP("    Codec specific config length : %d bytes\n",
                        PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength);
            if (PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength > 0u)
            {
              for (k = 0;k<PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength;k++)
              {
                if (PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k] > 0u)
                {
                  LOG_INFO_APP("      Length: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k]);
                  LOG_INFO_APP("        Type: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k+1u]);
                  LOG_INFO_APP("        Value: 0x");
                  for (l = 0 ;l<(PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k]-1);l++)
                  {
                    LOG_INFO_APP("%02x",PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k+2u+l]);
                  }
                  LOG_INFO_APP("\n");
                }
                k+=PBPAPP_Context.base_subgroups[i].pCodecSpecificConf[k];
              }
            }
            LOG_INFO_APP("    Metadata length : %d bytes\n",PBPAPP_Context.base_subgroups[i].MetadataLength);
            if (PBPAPP_Context.base_subgroups[i].MetadataLength > 0)
            {
              for (k = 0;k<PBPAPP_Context.base_subgroups[i].MetadataLength;k++)
              {
                if (PBPAPP_Context.base_subgroups[i].pMetadata[k] > 0u)
                {
                  LOG_INFO_APP("      Length: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pMetadata[k]);
                  LOG_INFO_APP("        Type: 0x%02x\n",PBPAPP_Context.base_subgroups[i].pMetadata[k+1u]);
                  LOG_INFO_APP("        Value: 0x");
                  for (l = 0 ;l<(PBPAPP_Context.base_subgroups[i].pMetadata[k]-1);l++)
                  {
                    LOG_INFO_APP("%02x",PBPAPP_Context.base_subgroups[i].pMetadata[k+2u+l]);
                  }
                  LOG_INFO_APP("\n");
                }
                k+=PBPAPP_Context.base_subgroups[i].pMetadata[k];
              }
            }
            LOG_INFO_APP("    Num_BIS : %d\n",PBPAPP_Context.base_subgroups[i].NumBISes);

            /* Parse BIS */
            for (j = 0; (j < PBPAPP_Context.base_subgroups[i].NumBISes) && (status == BLE_STATUS_SUCCESS); j++)
            {
              status = CAP_Broadcast_ParseBASEBIS(base_data->pBasePayload, base_data->BasePayloadLength, &(PBPAPP_Context.base_bis[j]),
                                                  &(index));
              base_data->pBasePayload += index;
              base_data->BasePayloadLength -= index;
              LOG_INFO_APP("      BIS INDEX : 0x%02x\n",PBPAPP_Context.base_bis[j].BIS_Index);
              LOG_INFO_APP("      Codec specific config length : %d bytes\n",PBPAPP_Context.base_bis[j].CodecSpecificConfLength);
              if (PBPAPP_Context.base_bis[j].CodecSpecificConfLength > 0u)
              {
                for (int k = 0;k<PBPAPP_Context.base_bis[j].CodecSpecificConfLength;k++)
                {
                  if (PBPAPP_Context.base_bis[j].pCodecSpecificConf[k] > 0u)
                  {
                    LOG_INFO_APP("        Length: 0x%02x\n",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k]);
                    LOG_INFO_APP("          Type: 0x%02x\n",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k+1u]);
                    LOG_INFO_APP("          Value: 0x");
                    for (int l = 0 ;l<(PBPAPP_Context.base_bis[j].pCodecSpecificConf[k]-1);l++)
                    {
                      LOG_INFO_APP("%02x",PBPAPP_Context.base_bis[j].pCodecSpecificConf[k+2u+l]);
                    }
                    LOG_INFO_APP("\n");
                  }
                  k+=PBPAPP_Context.base_bis[j].pCodecSpecificConf[k];
                }
              }
            }
          }
          LOG_INFO_APP("==>> End Start BAP BSNK Parse BASE Group INFO\n");

          if(PBPAPP_Context.BIGSyncState == PBPAPP_BIG_SYNC_STATE_IDLE)
          {
            memcpy(&PBPAPP_Context.codec_specific_config_subgroup[0],
                   PBPAPP_Context.base_subgroups[0].pCodecSpecificConf,
                   PBPAPP_Context.base_subgroups[0].CodecSpecificConfLength);
            PBPAPP_Context.base_group.PresentationDelay = PBPAPP_Context.base_group.PresentationDelay;

            uint32_t freq = LTV_GetConfiguredSamplingFrequency(PBPAPP_Context.base_subgroups[0].pCodecSpecificConf,
                                                               PBPAPP_Context.base_subgroups[0].CodecSpecificConfLength);

            LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",freq);
            AudioClock_Init(freq);
          }
        }
      break;
      }

